თეორია:
1)კომენტარების სახით ახსენით რა არის snake_case და camelCase, რა განსხვავებაა მათ შორის
--------------------------------------------------------------------------------------------------

2)კომენტარების სახით ახსენით რას ნიშნავს რომ პითონი არის case sentensive language
--------------------------------------------------------------------------------------------------

3)კომენატრების სახით ახსენით რა არის debugging
--------------------------------------------------------------------------------------------------

4)კომენტარების სახით ჩამოწერეთ ცვლადის სახელის შექმნის წესები
--------------------------------------------------------------------------------------------------

5)კომენტარების სახით ახსენით რა არის კომენტარი და რაში გამოიყენება
--------------------------------------------------------------------------------------------------


პრაქტიკა:
1)შეასწორეთ კოდში შეცდომები:
name -> "Giorgi'
print(name)

luka = "name"
print(Luka)

2helomynameis = "anamaria"
print(helomynameis)
--------------------------------------------------------------------------------------------------

2)შექმენით სამი ცვალდი სამივე ნასწავლი მონაცემთა ტიპით, შემდეგ დაპრინტეთ
--------------------------------------------------------------------------------------------------

3)შექმენით 1 ცვლადი snake_case ით და მეორე ცვლადი camelCase ით, ორივე დაპრინტეთ
--------------------------------------------------------------------------------------------------

4)მოიძიეთ ინფორმაცია სხვადასხვა ერორებზე და რას აღნიშნავენ ისინი(მაგ: SyntaxError, ValueError, TypeError, NameError)
--------------------------------------------------------------------------------------------------

5)შექმნით 10 ცვლადი 10 განსხვავებული მნიშვნოლობით, შემდეგ 10 ივე დაპრინტეთ